Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: :command:`register` can then be called with the -r option to point the repository to work with::
pl: polecenie :command:`register` ( - z ang. - rejestruj ) może być wywołane z opcją -r aby wskazać repozytorium z którym będzie pracować::

source: For convenience, the name of the section that describes the repository may also be used::
pl: Dla wygody, nazwa sekcji która opisuje repozytorium może także być użyta::

source: python setup.py register -r other
pl: python setup.py register -r inne

source: Writing the Setup Script
pl: Pisanie Skryptu Instalacyjnego

source: The setup script is the centre of all activity in building, distributing, and installing modules using the Distutils. The main purpose of the setup script is to describe your module distribution to the Distutils, so that the various commands that operate on your modules do the right thing. As we saw in section :ref:`distutils-simple-example` above, the setup script consists mainly of a call to :func:`setup`, and most information supplied to the Distutils by the module developer is supplied as keyword arguments to :func:`setup`.
pl: Skrypt instalacyjny jest w centrum wszystkich czynności podczas budowania, rozprowadzania i instalowania modułów przy użyciu Distutils. Głównym zadaniem skryptu instalacyjnego jest opisanie dystrybucji twojego modułu dla Distutils, tak aby różne polecenia które operują na twoich modułach robiły to prawidłowo. Jak widzieliśmy w rozdziale :ref:`distutils-simple-example` powyżej, skrypt instalacyjny składa się głównie z wywołania zadania :func:`setup`, i większość informacji dostarczonych do Distutils przez twórcę modułu jest dostarczonych jako parametrów kluczowych dla zadania :func:`setup`.

source: Here's a slightly more involved example, which we'll follow for the next couple of sections: the Distutils' own setup script. (Keep in mind that although the Distutils are included with Python 1.6 and later, they also have an independent existence so that Python 1.5.2 users can use them to install other module distributions. The Distutils' own setup script, shown here, is used to install the package into Python 1.5.2.) ::
pl: Tutaj jest trochę bardziej zaangażowany przykład, który będziemy śledzić przez następne parę rozdziałów: własny skrypt instalacyjny Distutils. (Pamiętaj, że chociaż Distutils są zawarte w języku pytonowskim 1.6 i wyższej, Distutils istnieją także niezależnie, tak, że użytkownicy języka pytonowskiego w wersji 1.5.2 mogą używać ich aby zainstalować dystrybucje innych modułów. Własny skrypt instalacyjny Distutils, pokazany tutaj, używany jest tutaj do zainstalowania pakietu dla języka pytonowskiego 1.5.2.) ::

source: There are only two differences between this and the trivial one-file distribution presented in section :ref:`distutils-simple-example`: more metadata, and the specification of pure Python modules by package, rather than by module. This is important since the Distutils consist of a couple of dozen modules split into (so far) two packages; an explicit list of every module would be tedious to generate and difficult to maintain. For more information on the additional meta-data, see section :ref:`meta-data`.
pl: Istnieją tylko dwie różnice pomiędzy tą i prostą jedno-plikową dystrybucją prezentowaną w rozdziale :ref:`distutils-simple-example`: więcej danych, i wyszczególnienie czysto pytonowskich modułów "przez pakiet", zamiast przez nazwę modułu. Jest to istotne skoro Distutils składają się z paru modułów rozdzielonych na (jak dotejpory) dwa pakiety; jawną listę wszystkich modułów byłaby żmudna w wytworzeniu i trudna w utrzymaniu. Po więcej informacji o dodatkowych danych o danych, sięgnij do rozdziału :ref:`meta-data` ( - z ang. - meta-dane - dane o danych).

source: Note that any pathnames (files or directories) supplied in the setup script should be written using the Unix convention, i.e. slash-separated. The Distutils will take care of converting this platform-neutral representation into whatever is appropriate on your current platform before actually using the pathname. This makes your setup script portable across operating systems, which of course is one of the major goals of the Distutils. In this spirit, all pathnames in this document are slash-separated.
pl: Zauważ, że jakiekolwiek nazwy ścieżek (plików lub katalogów) dostarczony w skrypcie instalacyjnym powinien być napisany używając konwencji Unixa, tj. separowanej-ukośnikami. Distutils zajmie się zamianą reprezentacji obojętnej wobec maszyny/środowiska zanim użycie ścieżki będzie możliwe. To sprawia że twój skrypt instalacyjny jest przenośny pomiędzy systemami operacyjnymi, co oczywiście jest jednym z głównych celów Distutils. W tym duchu nazwy ścieżek dostępu w tym dokumencie są separowane ukośnikiem.

source: This, of course, only applies to pathnames given to Distutils functions. If you, for example, use standard Python functions such as :func:`glob.glob` or :func:`os.listdir` to specify files, you should be careful to write portable code instead of hardcoding path separators::
pl: To rzecz jasna, stosuje się tylko do nazw ścieżek danych dla zadań Distutils. Jeśli na przykład używasz zadań standardowych języka pytonowskiego takich jak :func:`glob.glob` lub :func:`os.listdir` aby określać pliki, powinieneś uważać aby pisać przenośny kod zamiast go usztywniać w sprawie separatorów ścieżek::

source: Listing whole packages
pl: Tworzenie list całych pakietów

source: The :option:`packages` option tells the Distutils to process (build, distribute, install, etc.) all pure Python modules found in each package mentioned in the :option:`packages` list. In order to do this, of course, there has to be a correspondence between package names and directories in the filesystem. The default correspondence is the most obvious one, i.e. package :mod:`distutils` is found in the directory :file:`distutils` relative to the distribution root. Thus, when you say ``packages = ['foo']`` in your setup script, you are promising that the Distutils will find a file :file:`foo/__init__.py` (which might be spelled differently on your system, but you get the idea) relative to the directory where your setup script lives. If you break this promise, the Distutils will issue a warning but still process the broken package anyways.
pl: Opcja :option:`packages` mówi Distutils aby przetworzyć (zbudować, rozprowadzić, zainstalować, itp.) wszystkie czyste moduły języka pytonowskiego znajdujące się w każdym pakiecie z listy :option:`packages`. Aby tego dokonać oczywiście musi istnieć zależność między nazwami pakietów i katalogami w systemie plików. Domyślna zależność jest najoczywistsza, tj. pakiet :mod:`distutils` znajduje się w katalogu :file:`distutils` względem korzenia dystrybucji. Zatem gdy mówisz ``packages = ['foo']`` w skrypcie instalacyjnym, składasz obietnicę że Distutils znajdzie plik :file:`foo/__init__.py` (który może być przeliterowany inaczej w twoim systemie, ale wszyscy wiemy o co chodzi) względem katalogu gdzie znajduje się skrypt instalacyjny. Jeśli obietnica zostanie złamana, Distutils zgłosi ostrzeżenie ale przetworzy popsuty pakiet tak,czy inaczej.

source: If you use a different convention to lay out your source directory, that's no problem: you just have to supply the :option:`package_dir` option to tell the Distutils about your convention. For example, say you keep all Python source under :file:`lib`, so that modules in the "root package" (i.e., not in any package at all) are in :file:`lib`, modules in the :mod:`foo` package are in :file:`lib/foo`, and so forth. Then you would put ::
pl: Jeśli użyjesz innej konwencji aby rozplanować twój katalog źródłowy, nie będzie to stanowić problemu: musisz tylko dostarczyć opcję :option:`package_dir` aby powiadomić Distutils o twojej konwencji. Dla przykładu, załóżmy, że trzymasz wszystkie pliki źródłowe w katalogu :file:`lib`, tak że moduły w nadrzędnym pakiecie - z ang. - "root package" (tj. właściwie w żadnym pakiecie w ogóle) będą w katalogu :file:`lib`, moduły w pakiecie :mod:`foo` będą w katalogu :file:`lib/foo` itd. Wtedy ustawisz ::

source: in your setup script. The keys to this dictionary are package names, and an empty package name stands for the root package. The values are directory names relative to your distribution root. In this case, when you say ``packages = ['foo']``, you are promising that the file :file:`lib/foo/__init__.py` exists.
pl: w swoim skrypcie instalacyjnym. Kluczami do tego słownika są nazwy pakietów, a nazwa pakietu pustego oznacza pakiet nadrzędny ( - z ang. - dosł. - "root package"). Wartościami są nazwy katalogów względne wobec katalogu głównego dystrybucji. W tym przypadku gdy mówisz ``packages = ['foo']``, składasz obietnicę że plik :file:`lib/foo/__init__.py` istnieje.

source: Another possible convention is to put the :mod:`foo` package right in :file:`lib`, the :mod:`foo.bar` package in :file:`lib/bar`, etc. This would be written in the setup script as ::
pl: Inną możliwą konwencją jest umieszczenie pakietu :mod:`foo` od razu w katalogu :file:`lib`, pakietu :mod:`foo.bar` w katalogu :file:`lib/bar` itd. To byłoby zapisane w skrypcie instalacyjnym jako ::

source: A ``package: dir`` entry in the :option:`package_dir` dictionary implicitly applies to all packages below *package*, so the :mod:`foo.bar` case is automatically handled here. In this example, having ``packages = ['foo', 'foo.bar']`` tells the Distutils to look for :file:`lib/__init__.py` and :file:`lib/bar/__init__.py`. (Keep in mind that although :option:`package_dir` applies recursively, you must explicitly list all packages in :option:`packages`: the Distutils will *not* recursively scan your source tree looking for any directory with an :file:`__init__.py` file.)
pl: wpis ``pakiet: katalog`` - z ang. - ``package: dir`` w słowniku :option:`package_dir` niejawnie odnosi się do wszystkich pakietów poniżej *pakietu* tak więc przypadek :mod:`foo.bar` jest automatycznie obsługiwany tutaj. W tym przykładzie posiadanie pakietów ``packages = ['foo', 'foo.bar']`` mówi Distutils aby poszukiwać pliku :file:`lib/__init__.py` i pliku :file:`lib/bar/__init__.py`. (Pamiętaj że chociaż opcja :option:`package_dir` ma zastosowanie rekursywne, musisz jawnie napisać listę wszystkich pakietów w opcji :option:`packages`: Distutils nie będzie rekursywnie skanować twojego drzewa źródłowego w poszukiwaniu jakiegokolwiek katalogu z plikiem :file:`__init__.py`.)

source: Listing individual modules
pl: Tworzenie list pojedynczych modułów

source: For a small module distribution, you might prefer to list all modules rather than listing packages---especially the case of a single module that goes in the "root package" (i.e., no package at all). This simplest case was shown in section :ref:`distutils-simple-example`; here is a slightly more involved example::
pl: Dla małej dystrybucji modułu, mógłbyś chcieć wypisać wszystkie moduły zamiast wypisywać pakiety---szczególnie w przypadku pojedynczego modułu, który wchodzi w skład "nadrzędnego pakietu" - z ang. - "root package" (tj. żadnego pakietu wcale). Najprostszy przypadek został pokazany w sekcji :ref:`distutils-simple-example`; tutaj jest pokazany trochę bardziej zaangażowany przykład::

source: This describes two modules, one of them in the "root" package, the other in the :mod:`pkg` package. Again, the default package/directory layout implies that these two modules can be found in :file:`mod1.py` and :file:`pkg/mod2.py`, and that :file:`pkg/__init__.py` exists as well. And again, you can override the package/directory correspondence using the :option:`package_dir` option.
pl: To opisuje dwa moduły, jeden z nich w pakiecie "nadrzędnym" ( - z ang. - "root" ), drugi w pakiecie :mod:`pkg`. Znów domyślny rozkład pakietów/katalogów niejawnie zakłada że te dwa moduły można znaleźć w :file:`mod1.py` i :file:`pkg/mod2.py` i że :file:`pkg/__init__.py` istnieje zarówno. I znów, możesz obejść odpowiadanie pakietów/katalogów używając opcji :option:`package_dir`.

source: Describing extension modules
pl: Opisywanie modułów rozszerzających

source: Just as writing Python extension modules is a bit more complicated than writing pure Python modules, describing them to the Distutils is a bit more complicated. Unlike pure modules, it's not enough just to list modules or packages and expect the Distutils to go out and find the right files; you have to specify the extension name, source file(s), and any compile/link requirements (include directories, libraries to link with, etc.).
pl: Tak jak pisanie modułów rozszerzających języka pytonowskiego jest trochę bardziej skomplikowane niż pisanie czystych modułów języka pytonowskiego, opisywanie ich dla Distutils jest trochę bardziej skomplikowane. W przeciwieństwie do modułów czysto pytonowskich, nie wystarczy po prostu wypisać po prostu wszystkich modułów lub pakietów i oczekiwać, że Distutils znajdzie właściwe pliki; musisz określić nazwę rozszerzenia, plik(i) źródłowe, i wszystkie wymagania kompilacji i łączenia plików wynikowych (katalogi załączane, biblioteki z którymi nastąpi łączenie, itd.).

source: All of this is done through another keyword argument to :func:`setup`, the :option:`ext_modules` option. :option:`ext_modules` is just a list of :class:`Extension` instances, each of which describes a single extension module. Suppose your distribution includes a single extension, called :mod:`foo` and implemented by :file:`foo.c`. If no additional instructions to the compiler/linker are needed, describing this extension is quite simple::
pl: Wszystko to dokonuje się przez następny kluczowy parametr dla zadania :func:`setup` opcji :option:`ext_modules`. Opcja :option:`ext_modules` jest po prostu listą przykładów uogólnienia :class:`Extension`, z których każdy opisuje pojedynczy moduł rozszerzenia. Załóżmy że twoja dystrybucja zawiera jedno rozszerzenie, zwane :mod:`foo` i wypełnione przez :file:`foo.c`. Jeśli żadne dodatkowe instrukcje dla kompilatora, programu łączącego pliki wynikowe nie są potrzebne, opisywanie tego rozszerzenia jest całkiem proste::

source: The :class:`Extension` class can be imported from :mod:`distutils.core` along with :func:`setup`. Thus, the setup script for a module distribution that contains only this one extension and nothing else might be::
pl: Uogólnienie :class:`Extension` może być importowane z modułu :mod:`distutils.core` razem z zadaniem :func:`setup`. Zatem skrypt instalacyjny dla dystrybucji modułu, który zawiera tylko to rozszerzenie i nic więcej mógłby wyglądać::

source: The :class:`Extension` class (actually, the underlying extension-building machinery implemented by the :command:`build_ext` command) supports a great deal of flexibility in describing Python extensions, which is explained in the following sections.
pl: Uogólnienie :class:`Extension` (właściwie leżąca pod spodem machina budowania rozszerzeń wypełniona przez polecenie :command:`build_ext` daje całkiem sporo możliwości w opisywaniu rozszerzeń języka pytonowskiego, które są opisywane w następnych paragrafach.

source: Extension names and packages
pl: Nazwy i pakiety rozszerzeń.

source: The first argument to the :class:`Extension` constructor is always the name of the extension, including any package names. For example, ::
pl: Pierwszy parametr dla konstruktora :class:`Extension` jest zawsze nazwą rozszerzenia, zawierając jakiekolwiek nazwy pakietów. Na przykład, ::

source: describes an extension that lives in the root package, while ::
pl: opisuje rozszerzenie które przebywa w nadrzędnym pakiecie, podczas gdy::

source: describes the same extension in the :mod:`pkg` package. The source files and resulting object code are identical in both cases; the only difference is where in the filesystem (and therefore where in Python's namespace hierarchy) the resulting extension lives.
pl: opisuje tożsame rozszerzenie w pakiecie :mod:`pkg`. Pliki źródłowe i wynikający kod obiektowy są identyczne w obu przypadkach; jedyną różnicą jest gdzie w systemie plików (i stąd też gdzie w hierarchii przestrzeni nazw) wynikające rozszerzenie będzie przebywać.

source: If you have a number of extensions all in the same package (or all under the same base package), use the :option:`ext_package` keyword argument to :func:`setup`. For example, ::
pl: Jeśli masz pewną liczbę rozszerzeń wszystkich w tym samym pakiecie (lub wszystkie pod tym samym pakiecie bazowym), użyj kluczowego parametru :option:`ext_package` dla zadania :func:`setup`. Na przykład, ::

source: will compile :file:`foo.c` to the extension :mod:`pkg.foo`, and :file:`bar.c` to :mod:`pkg.subpkg.bar`.
pl: skompiluje plik :file:`foo.c` do rozszerzenia :mod:`pkg.foo`, i plik :file:`bar.c` do :mod:`pkg.subpkg.bar`.

source: Extension source files
pl: pliki źródłowe rozszerzenia

source: The second argument to the :class:`Extension` constructor is a list of source files. Since the Distutils currently only support C, C++, and Objective-C extensions, these are normally C/C++/Objective-C source files. (Be sure to use appropriate extensions to distinguish C++\ source files: :file:`.cc` and :file:`.cpp` seem to be recognized by both Unix and Windows compilers.)
pl: Drugim parametrem dla konstuktora uogólnienia :class:`Extension` jest lista plików źródłowych. Ponieważ Distutils obecnie wspiera tylko rozszerzenia C, C++, i Obiektywny-C, te są zwykłymi plikami źródłowymi C/C++/Obiektywny-C. (Upewnij się że używasz właściwego rozszerzenia dla rozróżnienia źródłowych plików C++: pliki :file:`.cc` i :file:`.cpp` wydaje się że są rozpoznawane przez zarówno Unix-owe jak i Windows-owe kompilatory.)

source: However, you can also include SWIG interface (:file:`.i`) files in the list; the :command:`build_ext` command knows how to deal with SWIG extensions: it will run SWIG on the interface file and compile the resulting C/C++ file into your extension.
pl: Jednakże, możesz też załączyć sprzęg plików SWIG (:file:`.i`) na liście; polecenie :command:`build_ext` wie jak radzić sobie z rozszerzeniami SWIG: uruchomi SWIG na pliku sprzęgu i skompiluje wynikający plik C/C++ do twojego rozszerzenia.

source: **\*\*** SWIG support is rough around the edges and largely untested! **\*\***
pl: **\*\*** Wsparcie dla SWIG jest ciężkie na brzegach i w większości nie przetestowane! **\*\***

source: This warning notwithstanding, options to SWIG can be currently passed like this::
pl: Pomimo tego ostrzeżenia, opcje dla sprzęgu SWIG mogą być obecnie przekazywane w następujący sposób::

source: Or on the commandline like this::
pl: Lub w wierszu poleceń w następujący sposób::

source: On some platforms, you can include non-source files that are processed by the compiler and included in your extension. Currently, this just means Windows message text (:file:`.mc`) files and resource definition (:file:`.rc`) files for Visual C++. These will be compiled to binary resource (:file:`.res`) files and linked into the executable.
pl: Na niektórych maszynach/środowiskach, możesz załączyć nie-źródłowe pliki które są przetwarzane przez kompilator i załączane w twoim rozszerzeniu. Obecnie, to po prostu oznacza pliki Windowsowych wiadomości tekstowych (:file:`.mc`) i definicji zasobów (:file:`.rc`) dla Visual C++. Te będą skompilowane do plików zasobów binarnych (:file:`.res`) i połączonych w plik wykonywalny.

source: Preprocessor options
pl: Opcje preprocesora

source: Three optional arguments to :class:`Extension` will help if you need to specify include directories to search or preprocessor macros to define/undefine: ``include_dirs``, ``define_macros``, and ``undef_macros``.
pl: Trzy opcjonalne parametry dla uogólnienia :class:`Extension` mogą pomóc jeśli potrzebujesz określić katalogi załączane do przeszukania lub makra preprocesora definiujące lub wyłączające definicję: ``include_dirs``, ``define_macros``, i ``undef_macros``.

source: For example, if your extension requires header files in the :file:`include` directory under your distribution root, use the ``include_dirs`` option::
pl: Dla przykładu, jeśli twoje rozszerzenie wymaga pliku nagłówkowego w katalogu :file:`include` pod twoim katalogiem nadrzędnym dystrybucji, użyj opcji ``include_dirs`` ::

source: You can specify absolute directories there; if you know that your extension will only be built on Unix systems with X11R6 installed to :file:`/usr`, you can get away with ::
pl: Możesz także określić bezwzględne ścieżki katalogów tutaj; jeśli wiesz że twoje rozszerzenie będzie budowane tylko na systemie Unix-owym z X11R6 zainstalowanym do pliku :file:`/usr`, może Ci ujść na sucho nawet::

source: You should avoid this sort of non-portable usage if you plan to distribute your code: it's probably better to write C code like ::
pl: Powinieneś unikać tego rodzaju nie-przenośnego użycia jeśli planujesz rozprowadzać swój kod: jest prawdopodobnie dużo lepiej pisać kod C w następujący sposób ::

source: If you need to include header files from some other Python extension, you can take advantage of the fact that header files are installed in a consistent way by the Distutils :command:`install_header` command. For example, the Numerical Python header files are installed (on a standard Unix installation) to :file:`/usr/local/include/python1.5/Numerical`. (The exact location will differ according to your platform and Python installation.) Since the Python include directory---\ :file:`/usr/local/include/python1.5` in this case---is always included in the search path when building Python extensions, the best approach is to write C code like ::
pl: Jeśli potrzebujesz załączyć pliki nagłówkowe z pewnych innych rozszerzeń języka pytonowskiego, możesz skorzystać z faktu, że pliki nagłówkowe są instalowane w jednoznaczny sposób przez polecenie Distutils :command:`install_header`. Na przykład pliki nagłówkowe numerycznego języka pytonowskiego (w standardowej instalacji Unixa) są instalowane do pliku :file:`/usr/local/include/python1.5/Numerical`. (Dokładne miejsce będzie się różnić w zależności od maszyny/środowiska i instalacji języka pytonowskiego.) Odkąd katalog załączeń języka pytonowskiego---\ :file:`/usr/local/include/python1.5` w tym przypadku---jest zawsze załączany w ścieżce przeszukiwania podczas budowy rozszerzeń języka pytonowskiego, najlepszym podejściem jest napisanie kodu C w następujący sposób ::

source: If you must put the :file:`Numerical` include directory right into your header search path, though, you can find that directory using the Distutils :mod:`distutils.sysconfig` module::
pl: Jeśli jednak musisz wstawić katalog załączeń :file:`Numerical` w całości do twojej ścieżki poszukiwań nagłówków, jednakże, możesz znaleźć ten katalog używając modułu :mod:`distutils.sysconfig` Distutils::

source: Even though this is quite portable---it will work on any Python installation, regardless of platform---it's probably easier to just write your C code in the sensible way.
pl: Chociaż nawet to jest całkiem przenośne---będzie działać na każdej instalacji języka pytonowskiego, niezależnie od maszyny/środowiska---jest prawdopodobnie dużo łatwiej po prostu napisać twój kod C w rozsądny sposób.
